class BotMessange(object):
    SPAVKA = u"""В разработке"""

    FAQ = u"""Какой вопрос у тебя возник?"""

    CONTACT = u"""
    Сайт ИЦТЭФ: phys.asu.ru  
    Vk: https://vk.com/ictef74 
    Адрес: г. Барнаул, пр. Красноармейский, 90, ауд. 306.\n  
    Почтовый адрес: 656049 г. Барнаул, пр. Ленина, 61.\n
    Телефоны:\n  
    Дирекция:+7(3852)29-12-24\n
    Кафедра Общей и экспериментальной физики: +7(3852)296-659\n  
    Кафедра Радиофизики и теоретической физики: +7(3852)296-668\n  
    Кафедра Информационной безопасности: +7(3852)296-656\n
    Кафедра ВТиЭ: +7(3852)296-644  
    
    E-mail:  
    • Директор - Макаров Сергей Викторович  makarov@phys.asu.ru  
    • Заместитель по учебной работе - Белозерских Василий Вениаминович  bww@phys.asu.ru  
    • Заместитель по внеучебной работе - Ладыгин Павел Сергеевич    pavel-ladygin@yandex.ru  
    • Cпециалист по учебно-методической работе — Чичварина Наталья Юрьевна  chichvarina@phys.asu.ru
    """
    PRIEZD = u"""Уважаемый студент! 
    
    В этом году продолжается особенный способ въезда в РФ, поэтому будь внимателен.  
    
    Перед приездом в Россию необходимо не менее чем за 7 дней до прибытия в РФ написать Ладыгину Павлу Сергеевичу (заместитель директора по внеучебной работе) письмо на почту pavel-ladygin@yandex.ru с информацией: 
    
    1. ФИО на русском и латиннице  
    2. Дата рождения  
    3. Номер серия документа, по которому будет осуществлен въезд  
    4. Гражданство  
    5. Предполагаемая дата прибытия  
    6. Нуждаетесь или нет в общаге для изоляции и последующего проживания в ней. 
    
    После отправки письма на электронную почту необходимо дождаться ответа от Ладыгина П.С. с согласованием даты въезда в РФ и возможности проживания в общежитиях студенческого городка АлтГУ.
    
    Для пересечения границы вам может понадобиться справка об обучении в АлтГУ. Закажите её в дирекции у Чичвариной Натальи Юрьевны. Её контакт chichvarina@phys.asu.ru .
    
    Не ранее чем за 3 календарных дня до прибытия в Россию студенту необходимо сдать тест на COVID-19 методом ПЦР и, если результат отрицательный, получить в своей стране соответствующий документ на русском или английском языке.  
    
    В течение 72 часов после въезда на территорию России иностранные обучающиеся должны сдать повторный ПЦР-тест. До получения результатов теста им необходимо соблюдать режим самоизоляции по месту проживания.   
    
    Справочно сообщаем контактные данные центров, осуществляющих лабораторные исследования на COVID-19 методом ПЦР в г. Барнауле:  
    
    1. ДНК-Диагностика +7 (3852) 289-060  
    2. Хелми +7 (3852) 56-01-03  
    3. Инвитро 8 800 200 3630  
    
    После получения отрицательного результата повторного теста на COVID-19 немедленно (в течении одного рабочего дня) студенту необходимо явиться в Управление международной деятельности АлтГУ (пр-т Ленина, д. 61, каб. 400, тел. +7 (3852) 291-253) для получения справки о допуске к очному обучению и оформления документов для постановки на миграционный учет.  
    
    Вакцинация иностранных студентов от Covid-19 носит рекомендательный характер, при этом все иностранные студенты, получившие справку о допуске к учебным занятиям, смогут начать учебный год в очном режиме.  
    
    Также дополнительно сообщаем, что в случае невозможности очного прибытия учебный год возможно начать в удаленном формате с использованием дистанционных образовательных технологий. 
    
    По поводу изоляции. 
    
    На сегодняшний день мы не знаем официальных дат заселения в общежитие для нашего института.  
    
    Какие варианты проведения изоляции до получения результатов теста есть? 
    - У кого-то на квартире. 
    - В хостеле (можем дать контакты, около 500 р/сутки) 
    - В общежитии №5 университета (бесплатно, но всего - 6 мест, что делает невозможным приезд всех в одно время) 
    
    Просьба учитывать это при планировании приезда в РФ. 
    
    ВНИМАНИЕ! Для заселения в общежитие потребуются дополнительные документы! Об этом будет сообщено дополнительно в пункте меню "Заселение в общежитие" телеграм-бота ИЦТЭФ.
    """
    DOMINTORY = u"""Студенты ИЦТЭФ живут в Общежитии №4 по адрессу ул. Крупской д.103. 
    Общежитие секционного типа, студенты проживают по 2-3 человека в комнатах. В каждой секции: 4 жилых комнаты, душ, туалет, кухня. 
    В течении года работают: учебная комната, актовый зал, теннисный зал, а так же бытовые комнаты: постирочная, гладильная и комната для сушки белья.
    
    Стоимость проживания 1132р/мес. для бюджетного набора 1532р/мес. для дополнительного набора.
    
    Если у Вас возникли вопросы касаемые общежития можете обратиться к председателю студенческого совета (ПСС) ИЦТЭФ Попыкину Вадиму Андреевичу vk.com/fakstor 
    Fakstor001@ya.ru (в теме письма указать "ИЦТЭФ")
    """
    IN_DOMINTORY = u"""Уважаемые студенты!  
    
    В этом году обновлен список документов к заселению. Просьба отнестись внимательно к их наличию.  
    
    С 18 августа ожидайте звонка, с Вами свяжутся председатель студенческого совета Попыкин Вадим Андреевич или помощник Прокопенко Анастасия Сергеевна, которые назначат дату и время вашего прибытия в корпус университета по адресу Красноармейский, 90 (корпус «К» АлтГУ). 
    
    Чтобы заселение прошло как можно быстрее, вам потребуется для медкомиссии:  
    
    1. Ксерокопия паспорта (2-3, 4-5 страница) и оригинал;  
    2. Ксерокопия прививочного сертификата и оригинал;  
    3. Ксерокопия полиса ОМС и оригинал;  
    4. Ксерокопия пенсионного страхового свидетельства (СНИЛС) и оригинал;  
    5. Результат флюорографического обследования со штампом медицинского учреждения (действителен в течение года);  
    6. Девушкам справку от гинеколога (действительна в течение 10 дней) со следующим оформлением: штамп медицинского учреждения, подпись и личная печать врача, печать для справок.  
    7. Фото 3х4 для оформления пропуска в общежитие.  
    
    План заселения следующий:  
    
    1. Вы приходите в корпус университета в назначенный день и час (не нужно приходить заранее!!!).  
    2. В назначенной аудитории будет организовано заполнение документов, которые мы вам предоставим.  
    3. Далее вы пройдёт инструктаж у заместителя директора по внеучебной и воспитательной работе Ладыгина Павла Сергеевича и направитесь за подписями: 
    
    1) Здравпункт (ул. Крупской, 103)  
    2) Бухгалтерия (606М, Ленина, 61 — Главный корпус АлтГУ);  
    3) Касса (первый этаж, Ленина, 61 — Главный корпус АлтГУ);  
    4) Студенческий городок (второй этаж, 215М, Ленина, 61 — Главный корпус АлтГУ);  
    5) Для иностранных граждан — Международный отдел (400М, Ленина, 61 — Главный корпус АлтГУ);  
    6) Студенческое общежитие (заведующая общежитием, ул. Крупской, 103).  
    
    Стоимость проживания в общежитии для бюджетного набора — 1132 р. / мес., для дополнительного набора — 1532 р./мес. Даты найма помещения (по умолчанию) — 01.09.2020-30.06.2021 (10 месяцев).  
    
    Возможна оплата через банк. Скоро прикрепим инструкцию.  
    
    Оплачивается весь указанный период проживания. 
    
    ВНИМАНИЕ! Возможны изменения. Следите.
    """
    VACIN = u"""На сегодняшний день вакцинация студентов от Covid-19 носит рекомендательный характер. Каждый из вас должен принять решение самостоятельно. Однако, ситуация может меняться.
    
    Старосты групп скоро начнут собирать информацию о том, кто уже  привился или собирается это сделать. Это необходимо просто для справки.
    
    Практически все преподаватели и сотрудники нашего института и университета уже привились.
    """
    LOST_CART = u"""
    ЧТО ДЕЛАТЬ, ЕСЛИ ПОТЕРЯЛ ЗАЧЁТКУ ИЛИ СТУДЕНЧЕСКИЙ БИЛЕТ
    
    1. Выяснить номер документа. Помните, что у студенческого билета и зачетной книжки он один и тот же. В самом крайнем-крайнем случае его можно узнать в деканате/дирекции.  
    2. Прийти (написать, позвонить) в редакцию газеты «За науку», чтобы подать объявление о том, что данный документ недействителен.  
    Адрес: natapisma7@gmail.com (в теме обязательно укажите: «Тоска объявлений»),  
    Телефон редакции: 29-12-60. 
    3. Дождаться публикации. Взять свежий номер «ЗН» и перечитать его от корки до корки. 
    4. Показать объявление о недействительности документа в деканате/дирекции своего института.  
    5. Дождаться восстановления документа.
    """
    ADMIN_HELP = u"""/add idtelegram НомерГруппы УровеньОбразования Курс - добавление пользователя\n id - идентификатор пользователя получить из /me \n номер группы \n уровень образования \n курс обучения
    
    # 0 - None
    # 1 - Бакалавр
    # 2 - Магистр
    # 3 - Аспирант
    # 4 - Админ

    
    Рассылка сообщений 
    /forward всем
    """

    WELCOME_HELP_MSG = u"""Этот бот поможет тебе найти ответы на все твои вопросы"""
    WELCOME_MSG = u"""Добро пожаловать {}"""
    WELCOME_ASK = u"""Вы студент или преподователь"""

    HELP = u"""Этот создан для помощи студентам"""

    MENU = u"""Меню"""

    ADMIN_REPLAY_HELP = u"""Пожалуйста зареплайте сообщение, которое хотите переслать"""

    GROUP_REMIND = u"""Введите номер вашей группы"""
    GROUP_HELP = u"""Введите /update_group номер группы\nНапример <b>/update_group 507</b>"""
    ABOUT_USER = u"""id <b>{}</b>\nusername <b>{}</b>\ngroup <b>{}</b>\nphone_number <b>{}</b>\nrole <b>{}</b>\n"""
    UNREGISTER_USER = u"""Напишите /start чтобы начать общение"""

    SCHEDULE_ERROR = u"Ошибка попробуйте поменять группу.\n Напишите /me чтобы проверить группу"

    ROLE = ["Студент", "Преподователь", "Абитуриент"]
    START_TEXT = ['Расписание', 'Заказать справку', 'Общежитие', 'Контакты', 'FAQ']
    FAQ_TEXT = ['Потерял студенческий/зачетку']
    DOM_TEXT = ["Заселение"]
    SCHEDULE = ["Предыдущая", "Текущая", "Следующая"]



